package webapp.resumegenerator.domain.model;

/**
 * Enum с идентификаторами департаментов для маркировки резюме и шаблонов.
 *
 * IT (Information Technology) - Этот отдел отвечает за все аспекты, связанные с технологиями, включая разработку программного обеспечения, обслуживание сетей, кибербезопасность и техническую поддержку.
 * HR (Human Resources) - Отдел кадров, который занимается подбором персонала, организацией обучения и развития сотрудников, а также решением трудовых вопросов и соблюдением трудового законодательства.
 * SALES - Отдел продаж, ответственный за привлечение клиентов, ведение переговоров, заключение сделок и поддержание отношений с клиентами.
 * MARKETING - Отдел маркетинга, который занимается разработкой стратегий продвижения продуктов или услуг, проведением рекламных кампаний, анализом рынка и управлением брендом.
 * FINANCE - Финансовый отдел, ответственный за управление бюджетом компании, контроль финансовых потоков, бухгалтерский учет, налоговую отчетность и аудит.
 * OPERATIONS - Операционный отдел, который координирует и оптимизирует основные бизнес-процессы, следит за выполнением производственных задач и управляет цепочками поставок.
 * CUSTOMER SERVICE - Служба поддержки клиентов, занимающаяся решением проблем и запросов клиентов, а также улучшением качества обслуживания.
 * RESEARCH & DEVELOPMENT (R&D) - Отдел исследований и разработок, который занимается созданием новых продуктов, улучшением существующих и внедрением инноваций.
 * LEGAL - Юридический отдел, предоставляющий правовую поддержку компании, консультирование по юридическим вопросам и сопровождение в судебных разбирательствах.
 * HRD (Human Resources Development) - Развитие человеческих ресурсов, который занимается организацией тренингов, семинаров и программ повышения квалификации для сотрудников компании.
 *
 */
public enum Department {
    IT,
    SALES,
    HR,
    MARKETING,
    FINANCE,
    OPERATIONS,
    CUSTOMER_SERVICE,
    RESEARCH_DEVELOPMENT,
    LEGAL,
    HRD
}
